1. i) Create a list of empids and names (10 employees).
   ii) Convert list into Series.
   iii) Convert Series into DataFrame.
   iv) a) Display all records.
      b) Display first five records.
      c) Display last five records.
   v) Save the record in csv file (MyRecord.csv)

In [3]:
import numpy as np
import pandas as pd

In [2]:
Employee_IDs=[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
Names= ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Hannah', 'Ian', 'Jack']

In [5]:
empid = pd.Series(Employee_IDs)

In [6]:
names = pd.Series(Names)

In [20]:
df = pd.DataFrame(names,Employee_IDs)

In [21]:
df

          0
1       Bob
2   Charlie
3     David
4       Eva
5     Frank
6     Grace
7    Hannah
8       Ian
9      Jack
10      NaN

In [11]:
df.head()

         0
0    Alice
1      Bob
2  Charlie
3    David
4      Eva

In [22]:
df.tail()

         0
6    Grace
7   Hannah
8      Ian
9     Jack
10     NaN

In [23]:
df.to_csv("MyRecord.csv")